<script setup lang='ts'>
  import { ref } from 'vue';
import BecPanel from './BecPanel.vue';


const BecPanelList = ref([
  { 
    title: "Что от меня вообще требуется?",
    list: ['Мы ждём, что наставник будет делиться своим опытом со своим подопечным, мотивировать его и помогать двигаться вперёд. Проводить созвоны делать код ревью.']
  },
  {
    title: "Как составлять план обучения и что делать, если в этом вообще нет опыта?",
    list: ['Если затрудняетесь в том как строить обучение с учеником, пишите нам, мы вам с радостью поможем.']
  },
  {
    title: "Я обладаю хорошим опытом, но понятия не имею про всякие резюме. Что делать в этом случае?",
    list: ['На этот случай у нас есть материалы и рекомендации. С их помощью вы сможете сориентироваться.']
  },
  {
    title: "Какая мне от этого польза?",
    list: ['Студент может задавать самые разные вопросы. Это отлично структурирует знания. Так же это отлично прокачивает софтскилы. Ну и от подбора проекта и задач напрямую зависит мотивация и успех подопечного.']
  },
  {
    title: "Сколько я получу за это?",
    list: ['Цену за занятие вы определяете сами, в среднем это от 2000 до 4500 рублей за консультацию, всё зависит от вашего стажа и умений.']
  },
  {
    title: "Хорошо мне нравиться. Что нужно чтобы стать наставником?",
    list: ['Чтобы стать наставником подайте заявку, и мы свяжемся с вами.']
  }
])
</script>
<template>
  <h3 class=" font-semibold text-4xl leading-[44px] laptop:ml-[90px] ml-3 mt-[100px]">Частые вопросы</h3>
  <div class=" mt-[100px]">
    <BecPanel v-for="(item, index) in BecPanelList" :key="index" :title="item.title" :list="item.list"/>
  </div>
</template>
<style>
    
</style>