<script setup lang='ts'>
  import { ref } from 'vue';
import compPanel from './compPanel.vue';


const panelList = ref([
  { 
    title: "Как получить консультацию?",
    list: ['1. Выберите куратора из списка. Можете выбрать сами или обратиться за помощью к нам — подскажем, кто сможет помочь с вашим запросом. Напишите в чат поддержки или нажмите на кнопку подбора куратора','2. Оставьте заявку на консультацию по почте или в Telegram.','3. Мы с вами свяжемся. Уточним запрос, договоримся о дате и времени консультации, отправим ссылку для оплаты.','4. После оплаты добавим вас в чат с куратором и отправим ссылку на комнату для видеозвонка.']
  },
  {
    title: "С чем к нам обращаются?",
    list: ['— Как устроиться на работу без опыта', '— Как выбрать новую профессию', '— Где получить профессиональное образование', '— Как поменять место работы или сферу деятельности', '— Как оформить сильное резюме и портфолио', '— Как получить повышение и увеличить зарплату', '— Как справиться с выгоранием и синдромом самозванца', '— Как найти работу за границей']
  },
  {
    title: "Как выбрать эксперта?",
    list: ['1. Определите ваш запрос. Что вы хотите от консультации? Например, найти первую работу, упаковать ваш опыт в сильное резюме или узнать, как развиваться в дизайне.', '2. Настройте фильтры поиска на странице с кураторами. Можно указать цель консультации, интересную вам сферу и компанию, со специалистом из которой вы хотели бы пообщаться.', '3. Изучите профили кураторов. Посмотрите на их опыт и цели, которые они помогают достигать.', '4. Почитайте отзывы наших учеников. Возможно, кто-то из кураторов помог им в схожей ситуации.', '5. Или просто нажмите на кнопку подбора куратора :) Мы познакомимся с вашим запросом и подберём кураторов, которые смогут с ним помочь. Вы сами решите, к кому из них обратиться.']
  },
  {
    title: "Что от меня требуется перед началом консультации?",
    list: ['1. Сформулируйте запрос. Расскажите нашим менеджерам, что вы хотите обсудить на консультации и какой результат ожидаете. Это поможет нам понять ваши потребности и донести их до куратора.', '2. Найдите тихое место, чтобы во время видеозвонка вас ничего не отвлекало.', '3. Подготовьте вопросы. Перед встречей подготовьте любые вопросы, какие у вас успели накопиться, а также озвучьте ожидаемые от консультации результаты.', '4. Подготовьте резюме, портфолио или тестовое задание, которое хотите разобрать на консультации. Их попросят наши менеджеры до консультации и передадут куратору, чтобы он подготовился к встрече.']
  },
  {
    title: "Что меня ждёт после консультации?",
    list: ['1. Поддержка куратора в чате. В течение одной недели после консультации сможете общаться, задавать вопросы, дорабатывать резюме.', '2. Полезные материалы. Куратор поделится подборкой материалов, курсов и ссылок, которые вы обсуждали на консультации.', '3. Домашнее задание. Если куратор даст вам задание, после его выполнения обсудите результаты в чате и получите рекомендации', '4.В чате вы также можете договориться с нами о следующей консультации, поделиться успехами и дать обратную связь, чтобы помочь нам стать лучше :)']
  }
])
</script>
<template>
  <h3 class="font-bold text-5xl leading-[52px] text-center mt-[100px]">Вопросы и ответы</h3>
  <div class="mt-[100px]">
    <compPanel v-for="(item, index) in panelList" :key="index" :title="item.title" :list="item.list"/>
  </div>
</template>
<style>
    
</style>